#!/usr/bin/env python
# -*- encoding: utf-8 -*-
# -*- coding:utf-8 -*-
'''
@File : invoke_query.py
@Link :    
@name_explain :   _list(list类型); _int(int类型); _str(string类型); _set(set类型)
@Description :
@Modify Time         @Author    @Version    
---------------      -------    --------
2021/4/30 10:37      zc         1.0         
'''

from connection_neo4j import connection_neo4j
from parse_condition import get_condition, parse_condition

condition_str = '[{"necessary_condition":{"all":{"姓名":[],"性别":[],"年龄":[],"否定症状":[],"否定疾病":[],"否定手术治疗":[],"否定非手术治疗":[],"否定药品":[],"科室":[],"部位对应症状":[],"精神特征对应结果":[],"生理特征对应结果":[],"生理指标对应数量":[],"肯定症状":[["头痛"],["头晕"],["恶心"],["呕吐"]],"肯定疾病":[],"肯定手术治疗":[],"肯定非手术治疗":[],"肯定药品名":[]},"zs":{"时间":[],"肯定症状":[],"否定症状":[],"部位对应症状":[]},"xbs":{"否定症状":[],"否定疾病":[],"否定手术治疗":[],"否定非手术治疗":[],"否定药品":[],"科室":[],"部位对应症状":[],"精神特征对应结果":[],"生理特征对应结果":[],"生理指标对应数量":[],"肯定症状":[["头痛"],["头晕"],["恶心"],["呕吐"]],"肯定疾病":[],"肯定手术治疗":[],"肯定非手术治疗":[],"肯定药品名":[]}}},{"sufficient_condition":{"all":{"姓名":[],"性别":[],"年龄":[],"否定症状":[],"否定疾病":[],"否定手术治疗":[],"否定非手术治疗":[],"否定药品":[],"科室":[],"部位对应症状":[],"精神特征对应结果":[],"生理特征对应结果":[],"生理指标对应数量":[],"肯定症状":[["头痛"],["头晕"],["恶心"],["呕吐"]],"肯定疾病":[],"肯定手术治疗":[],"肯定非手术治疗":[],"肯定药品名":[]},"zs":{"时间":[],"肯定症状":[],"否定症状":[],"部位对应症状":[]},"xbs":{"否定症状":[],"否定疾病":[],"否定手术治疗":[],"否定非手术治疗":[],"否定药品":[],"科室":[],"部位对应症状":[],"精神特征对应结果":[],"生理特征对应结果":[],"生理指标对应数量":[],"肯定症状":[["头痛"],["头晕"],["恶心"],["呕吐"]],"肯定疾病":[],"肯定手术治疗":[],"肯定非手术治疗":[],"肯定药品名":[]}}}]'

graph = connection_neo4j()
condition_object = get_condition(condition_str)

